app/views/shelters/local.html.erb

<div class="flex-container">
<% @current_user.local_shelters.each do |shelter| %>
---
SELECT "shelters".* FROM "shelters"