app/views/shelters/show.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 4]]
---
<div class="shelter_pets_flex_container">
<% if @shelter.pets.length > 0 %>
    <% @shelter.pets.uniq.each do |pet| %>