app/views/adopters/new.html.erb

<ul>
<% Pet.all.each do |pet| %>
---
SELECT "pets".* FROM "pets"

<ul>
<% Adopter.all.each do |adopter| %>
---
SELECT "adopters".* FROM "adopters"

<ul>
<% Shelter.all.each do |shelter| %>
---
SELECT "shelters".* FROM "shelters"