app/views/pets/show.html.erb

<h3>💕 TAKEN 💕 </h3>
<h4> Adopted by <%=Adopter.find_by(id: @pet.adopter.id).name %></h4>
---
SELECT "adopters".* FROM "adopters" INNER JOIN "favorites" ON "adopters"."id" = "favorites"."adopter_id" WHERE "favorites"."pet_id" = $1  [["pet_id", 1]]