app/views/pets/show.html.erb

<h3>💕 TAKEN 💕 </h3>
<h4> Adopted by <%=Adopter.find_by(id: @pet.adopter.id).name %></h4>
---
SELECT "adopters".* FROM "adopters" INNER JOIN "adoptions" ON "adopters"."id" = "adoptions"."adopter_id" WHERE "adoptions"."pet_id" = $1 LIMIT $2  [["pet_id", 9], ["LIMIT", 1]]