app/controllers/adopters_controller.rb

  def set_adopter
    @adopter = Adopter.find(params[:id])
---
SELECT "adopters".* FROM "adopters" WHERE "adopters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]