app/controllers/adopters_controller.rb

SELECT "adopters".* FROM "adopters" WHERE "adopters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
 def show
    @adopter = Adopter.find(params[:id])

INSERT INTO "adopters" ("name", "description", "zip", "avatar", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
      @adopter = Adopter.create!(adopter_params)

UPDATE "adopters" SET "password_digest" = $1, "updated_at" = $2 WHERE "adopters"."id" = $3  [["password_digest", "$2a$10$vCgNkwVLLa6xHo8q2n89d..FDRGEjEMqywXC5x0.p3f180aOoct.K"], ["updated_at", "2019-10-25 14:39:10.064243"], ["id", 4]]
---
  def update
    @adopter.update(adopter_params)

SELECT "adopters".* FROM "adopters" WHERE "adopters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_adopter
    @adopter = Adopter.find(params[:id])