app/controllers/adoptions_controller.rb

   def show
       @adoption = Adoption.find(params[:id])
---
SELECT "adoptions".* FROM "adoptions" WHERE "adoptions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   def create
      @adoption = Adoption.create(adoption_params)
      @pet = Pet.find(@adoption.pet_id)
      @pet.adoption_status = true
      @pet.save
---
INSERT INTO "adoptions" ("adopter_id", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["adopter_id", 9], ["pet_id", 1], ["created_at", "2019-10-23 14:27:48.814415"], ["updated_at", "2019-10-23 14:27:48.814415"]]
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "pets" SET "adoption_status" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["adoption_status", true], ["updated_at", "2019-10-23 15:01:50.730612"], ["id", 5]]