app/controllers/application_controller.rb

SELECT "adopters".* FROM "adopters" WHERE "adopters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_current_user
        @current_user = Adopter.find_by(id: session[:adopter_id])