app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("adopter_id", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["adopter_id", 9], ["pet_id", 1], ["created_at", "2019-10-23 14:27:21.636184"], ["updated_at", "2019-10-23 14:27:21.636184"]]
---
  def create
      @favorite = Favorite.create(favorite_params)