app/controllers/sessions_controller.rb

SELECT "adopters".* FROM "adopters" WHERE "adopters"."name" = $1 LIMIT $2  [["name", ""], ["LIMIT", 1]]
---
    def create
      current_user = Adopter.find_by(name: params[:session][:name])