app/controllers/shelters_controller.rb

SELECT "shelters".* FROM "shelters"
---
    def index
        @shelters = Shelter.all

SELECT "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @shelter = Shelter.find(params[:id])

SELECT "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @shelter = Shelter.find(params[:id])

SELECT "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        @shelter = Shelter.find(params[:id])