app/models/adopter.rb

    def local_shelters
        Shelter.all.select do |shelter|
---
SELECT "shelters".* FROM "shelters"

    def local_pets
        local_pets = []
        if local_shelters.length > 0
            local_shelters.each do |shelter|
                shelter.pets.all.each do |pet|
---
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 1]]